# =============================================================================
# Layer 1: Homebrew Packages
# =============================================================================
# This file defines system infrastructure and GUI applications.
# CLI tools and runtimes are managed by Mise (Layer 3).
# AI coding CLIs with curl installers are in scripts/curl-installs.sh (Layer 5).
# =============================================================================

# --- Core (DO NOT REMOVE - required for installation) ---
brew "mise"     # Version manager for runtimes and CLI tools
brew "stow"     # Symlink manager for config deployment
brew "sheldon"  # Zsh plugin manager

# --- System Utilities ---
brew "mas"      # Mac App Store CLI (for Layer 4)
brew "sevenzip" # Archive tool

# --- GUI Terminals ---
cask "ghostty"
cask "warp"

# --- Editors ---
cask "zed"
cask "visual-studio-code"
cask "antigravity"

# --- Browsers ---
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"

# --- AI Desktop Apps ---
cask "claude"           # Claude Desktop (Anthropic) - GUI chat interface
cask "chatgpt"          # ChatGPT Desktop (OpenAI) - GUI chat interface
cask "codex"            # Codex Desktop (OpenAI) - AI coding GUI
cask "opencode-desktop" # OpenCode Desktop (Anomaly) - AI coding GUI
# Note: AI CLI tools (claude-code, opencode) are installed via Layer 5 curl scripts

# --- Other GUI Apps ---
cask "raycast"
cask "obsidian"
cask "wispr-flow"
cask "discord"
cask "spotify"
cask "vlc"
