# --- Core ---
brew "mise" # Install Mise for Version Management, DO NOT REMOVE as it is needed later in the installation process
brew "stow" # DO NOT REMOVE as it is needed later in the installation process
brew "sheldon" # DO NOT REMOVE this is the zsh plugin manager
# --- Essentials ---
brew "mas"
brew "sevenzip"
brew "tree"
brew "wget"

# --- GUI Terminals ---
cask "ghostty"
cask "warp"

# --- Editors ---
cask "zed"
cask "visual-studio-code"
cask "antigravity"

# --- Browsers ---
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"

# --- GUI APPS ---
cask "raycast"
cask "obsidian"
cask "wispr-flow"
cask "discord"
cask "spotify"
cask "vlc"
cask "chatgpt"
cask "claude-code"
